aethaniel/ExperimentalCore-sam/module/boards.txt

arduino_due_dbg.name=Arduino Due (Programming Port)
arduino_due_dbg.vid.0=0x2341
arduino_due_dbg.pid.0=0x003d
arduino_due_dbg.vid.1=0x2A03
arduino_due_dbg.pid.1=0x003d
arduino_due_dbg.upload.tool=bossac
arduino_due_dbg.upload.protocol=sam-ba
arduino_due_dbg.upload.maximum_size=524288
arduino_due_dbg.upload.use_1200bps_touch=true
arduino_due_dbg.upload.wait_for_upload_port=false
arduino_due_dbg.upload.native_usb=false
arduino_due_dbg.build.mcu=cortex-m3
arduino_due_dbg.build.f_cpu=84000000L
arduino_due_dbg.build.usb_product="Arduino Due"
arduino_due_dbg.build.board=SAM_DUE
arduino_due_dbg.build.core=arduino
arduino_due_dbg.build.extra_flags=-D__SAM3X8E__ -mthumb {build.usb_flags}
arduino_due_dbg.build.ldscript=linker_scripts/gcc/variant_without_bootloader.ld
arduino_due_dbg.build.variant=arduino_due
arduino_due_dbg.build.vid=0x2341
arduino_due_dbg.build.pid=0x003e
arduino_due_dbg.build.usb_flags.off=-DUSB_VID={build.vid} -DUSB_PID={build.pid} -DUSBCON '-DUSB_MANUFACTURER={build.usb_manufacturer}' '-DUSB_PRODUCT={build.usb_product}'

arduino_due.name=Arduino Due (Native USB Port)
arduino_due.vid.0=0x2341
arduino_due.pid.0=0x003e
arduino_due.vid.1=0x2A03
arduino_due.pid.1=0x003e
arduino_due.upload.tool=bossac
arduino_due.upload.protocol=sam-ba
arduino_due.upload.maximum_size=524288
arduino_due.upload.use_1200bps_touch=true
arduino_due.upload.wait_for_upload_port=true
arduino_due.upload.native_usb=true
arduino_due.build.mcu=cortex-m3
arduino_due.build.f_cpu=84000000L
arduino_due.build.usb_product="Arduino Due"
arduino_due.build.board=SAM_DUE
arduino_due.build.core=arduino
arduino_due.build.extra_flags=-D__SAM3X8E__ -mthumb {build.usb_flags}
arduino_due.build.ldscript=linker_scripts/gcc/variant_without_bootloader.ld
arduino_due.build.variant=arduino_due
arduino_due.build.vid=0x2341
arduino_due.build.pid=0x003e
arduino_due.build.usb_flags.off=-DUSB_VID={build.vid} -DUSB_PID={build.pid} -DUSBCON '-DUSB_MANUFACTURER={build.usb_manufacturer}' '-DUSB_PRODUCT={build.usb_product}'

atmel_sam4s_xplained_dbg.name=Atmel SAM4S-Xplained (Programming Port)
atmel_sam4s_xplained_dbg.vid.0=0x1366
atmel_sam4s_xplained_dbg.pid.0=0x0105
atmel_sam4s_xplained_dbg.upload.tool=openocd
atmel_sam4s_xplained_dbg.upload.protocol=sam-ba
atmel_sam4s_xplained_dbg.upload.maximum_size=1048576
atmel_sam4s_xplained_dbg.upload.use_1200bps_touch=true
atmel_sam4s_xplained_dbg.upload.wait_for_upload_port=false
atmel_sam4s_xplained_dbg.upload.native_usb=false
atmel_sam4s_xplained_dbg.build.mcu=cortex-m4
atmel_sam4s_xplained_dbg.build.f_cpu=120000000L
atmel_sam4s_xplained_dbg.build.usb_product="Atmel SAM4S-Xplained"
atmel_sam4s_xplained_dbg.build.board=SAM_SAM4S_XPLD
atmel_sam4s_xplained_dbg.build.core=arduino
atmel_sam4s_xplained_dbg.build.extra_flags=-D__SAM4S16C__ -mthumb {build.usb_flags}
atmel_sam4s_xplained_dbg.build.ldscript=linker_scripts/gcc/variant_without_bootloader.ld
atmel_sam4s_xplained_dbg.build.openocdscript=openocd_scripts/variant.cfg
atmel_sam4s_xplained_dbg.build.variant=atmel_sam4s_xplained
atmel_sam4s_xplained_dbg.build.vid=0x2341
atmel_sam4s_xplained_dbg.build.pid=0x003e
atmel_sam4s_xplained_dbg.build.usb_flags.off=-DUSB_VID={build.vid} -DUSB_PID={build.pid} -DUSBCON '-DUSB_MANUFACTURER={build.usb_manufacturer}' '-DUSB_PRODUCT={build.usb_product}'
atmel_sam4s_xplained_dbg.bootloader.tool=openocd
atmel_sam4s_xplained_dbg.bootloader.file=openblt/atmel_sam4s_xplained.bin

atmel_sam4s_xplained_sam_ice.name=Atmel SAM4S-WPIR-RD (SAM-ICE)
atmel_sam4s_xplained_sam_ice.vid.0=0x1366
atmel_sam4s_xplained_sam_ice.pid.0=0x0105
atmel_sam4s_xplained_sam_ice.upload.tool=openocd
atmel_sam4s_xplained_sam_ice.upload.protocol=sam-ba
atmel_sam4s_xplained_sam_ice.upload.maximum_size=1048576
atmel_sam4s_xplained_sam_ice.upload.use_1200bps_touch=true
atmel_sam4s_xplained_sam_ice.upload.wait_for_upload_port=false
atmel_sam4s_xplained_sam_ice.upload.native_usb=false
atmel_sam4s_xplained_sam_ice.build.mcu=cortex-m4
atmel_sam4s_xplained_sam_ice.build.f_cpu=120000000L
atmel_sam4s_xplained_sam_ice.build.usb_product="Atmel SAM4S-WPIR-RD"
atmel_sam4s_xplained_sam_ice.build.board=SAM_SAM4S_WPIR_RD
atmel_sam4s_xplained_sam_ice.build.core=arduino
atmel_sam4s_xplained_sam_ice.build.extra_flags=-D__SAM4S16C__ -mthumb {build.usb_flags}
atmel_sam4s_xplained_sam_ice.build.ldscript=linker_scripts/gcc/variant_without_bootloader.ld
atmel_sam4s_xplained_sam_ice.build.openocdscript=openocd_scripts/variant.cfg
atmel_sam4s_xplained_sam_ice.build.variant=atmel_sam4s_xplained
atmel_sam4s_xplained_sam_ice.build.vid=0x2341
atmel_sam4s_xplained_sam_ice.build.pid=0x003e
atmel_sam4s_xplained_sam_ice.build.usb_flags.off=-DUSB_VID={build.vid} -DUSB_PID={build.pid} -DUSBCON '-DUSB_MANUFACTURER={build.usb_manufacturer}' '-DUSB_PRODUCT={build.usb_product}'
atmel_sam4s_xplained_sam_ice.bootloader.tool=openocd
atmel_sam4s_xplained_sam_ice.bootloader.file=openblt/atmel_sam4s_wpir_rd.bin

atmel_sam4s_xplained_atmel_ice.name=Atmel SAM4S-WPIR-RD (Atmel-ICE)
atmel_sam4s_xplained_atmel_ice.vid.0=0x1366
atmel_sam4s_xplained_atmel_ice.pid.0=0x0105
atmel_sam4s_xplained_atmel_ice.upload.tool=openocd
atmel_sam4s_xplained_atmel_ice.upload.protocol=sam-ba
atmel_sam4s_xplained_atmel_ice.upload.maximum_size=1048576
atmel_sam4s_xplained_atmel_ice.upload.use_1200bps_touch=true
atmel_sam4s_xplained_atmel_ice.upload.wait_for_upload_port=false
atmel_sam4s_xplained_atmel_ice.upload.native_usb=false
atmel_sam4s_xplained_atmel_ice.build.mcu=cortex-m4
atmel_sam4s_xplained_atmel_ice.build.f_cpu=120000000L
atmel_sam4s_xplained_atmel_ice.build.usb_product="Atmel SAM4S-WPIR-RD"
atmel_sam4s_xplained_atmel_ice.build.board=SAM_SAM4S_WPIR_RD
atmel_sam4s_xplained_atmel_ice.build.core=arduino
atmel_sam4s_xplained_atmel_ice.build.extra_flags=-D__SAM4S16C__ -mthumb {build.usb_flags}
atmel_sam4s_xplained_atmel_ice.build.ldscript=linker_scripts/gcc/variant_without_bootloader.ld
atmel_sam4s_xplained_atmel_ice.build.openocdscript=openocd_scripts/variant.cfg
atmel_sam4s_xplained_atmel_ice.build.variant=atmel_sam4s_xplained
atmel_sam4s_xplained_atmel_ice.build.vid=0x2341
atmel_sam4s_xplained_atmel_ice.build.pid=0x003e
atmel_sam4s_xplained_atmel_ice.build.usb_flags.off=-DUSB_VID={build.vid} -DUSB_PID={build.pid} -DUSBCON '-DUSB_MANUFACTURER={build.usb_manufacturer}' '-DUSB_PRODUCT={build.usb_product}'
atmel_sam4s_xplained_atmel_ice.bootloader.tool=openocd
atmel_sam4s_xplained_atmel_ice.bootloader.file=openblt/atmel_sam4s_wpir_rd.bin

atmel_sam4s_xplained_pro_dbg.name=Atmel SAM4S-Xplained Pro (Programming Port)
atmel_sam4s_xplained_pro_dbg.vid.0=0x03eb
atmel_sam4s_xplained_pro_dbg.pid.0=0x2111
atmel_sam4s_xplained_pro_dbg.upload.tool=openocd
atmel_sam4s_xplained_pro_dbg.upload.protocol=sam-ba
atmel_sam4s_xplained_pro_dbg.upload.maximum_size=2097152
atmel_sam4s_xplained_pro_dbg.upload.use_1200bps_touch=true
atmel_sam4s_xplained_pro_dbg.upload.wait_for_upload_port=false
atmel_sam4s_xplained_pro_dbg.upload.native_usb=false
atmel_sam4s_xplained_pro_dbg.build.mcu=cortex-m4
atmel_sam4s_xplained_pro_dbg.build.f_cpu=120000000L
atmel_sam4s_xplained_pro_dbg.build.usb_product="Atmel SAM4S-Xplained Pro"
atmel_sam4s_xplained_pro_dbg.build.board=SAM_SAM4S_XPRO
atmel_sam4s_xplained_pro_dbg.build.core=arduino
atmel_sam4s_xplained_pro_dbg.build.extra_flags=-D__SAM4SD32C__ -mthumb {build.usb_flags}
atmel_sam4s_xplained_pro_dbg.build.ldscript_path={build.variant.path}/linker_scripts/gcc
atmel_sam4s_xplained_pro_dbg.build.ldscript=variant_without_bootloader.ld
atmel_sam4s_xplained_pro_dbg.build.openocdscript=openocd_scripts/variant.cfg
atmel_sam4s_xplained_pro_dbg.build.variant=atmel_sam4s_xplained_pro
atmel_sam4s_xplained_pro_dbg.build.vid=0x2341
atmel_sam4s_xplained_pro_dbg.build.pid=0x003e
atmel_sam4s_xplained_pro_dbg.build.usb_flags.off=-DUSB_VID={build.vid} -DUSB_PID={build.pid} -DUSBCON '-DUSB_MANUFACTURER={build.usb_manufacturer}' '-DUSB_PRODUCT={build.usb_product}'
atmel_sam4s_xplained_pro_dbg.bootloader.tool=openocd
atmel_sam4s_xplained_pro_dbg.bootloader.file=openblt/atmel_sam4s_xplained_pro.bin

atmel_sam4e_xplained_pro_dbg.name=Atmel SAM4E-Xplained Pro (Programming Port)
atmel_sam4e_xplained_pro_dbg.vid.0=0x03eb
atmel_sam4e_xplained_pro_dbg.pid.0=0x2111
atmel_sam4e_xplained_pro_dbg.upload.tool=openocd
atmel_sam4e_xplained_pro_dbg.upload.protocol=sam-ba
atmel_sam4e_xplained_pro_dbg.upload.maximum_size=1048576
atmel_sam4e_xplained_pro_dbg.upload.use_1200bps_touch=true
atmel_sam4e_xplained_pro_dbg.upload.wait_for_upload_port=false
atmel_sam4e_xplained_pro_dbg.upload.native_usb=false
atmel_sam4e_xplained_pro_dbg.build.mcu=cortex-m4
atmel_sam4e_xplained_pro_dbg.build.f_cpu=120000000L
atmel_sam4e_xplained_pro_dbg.build.usb_product="Atmel SAM4E-Xplained Pro"
atmel_sam4e_xplained_pro_dbg.build.board=SAM_SAM4E_XPRO
atmel_sam4e_xplained_pro_dbg.build.core=arduino
atmel_sam4e_xplained_pro_dbg.build.extra_flags=-D__SAM4E16E__ -mthumb {build.usb_flags}
atmel_sam4e_xplained_pro_dbg.build.ldscript=linker_scripts/gcc/variant_without_bootloader.ld
atmel_sam4e_xplained_pro_dbg.build.openocdscript=openocd_scripts/variant.cfg
atmel_sam4e_xplained_pro_dbg.build.variant=atmel_sam4e_xplained_pro
atmel_sam4e_xplained_pro_dbg.build.vid=0x2341
atmel_sam4e_xplained_pro_dbg.build.pid=0x003e
atmel_sam4e_xplained_pro_dbg.build.usb_flags.off=-DUSB_VID={build.vid} -DUSB_PID={build.pid} -DUSBCON '-DUSB_MANUFACTURER={build.usb_manufacturer}' '-DUSB_PRODUCT={build.usb_product}'
atmel_sam4e_xplained_pro_dbg.bootloader.tool=openocd
atmel_sam4e_xplained_pro_dbg.bootloader.file=openblt/atmel_sam4e_xplained_pro.bin

atmel_samg55_xplained_pro_dbg.name=Atmel SAMG55-Xplained Pro (Programming Port)
atmel_samg55_xplained_pro_dbg.vid.0=0x03eb
atmel_samg55_xplained_pro_dbg.pid.0=0x2111
atmel_samg55_xplained_pro_dbg.upload.tool=openocd
atmel_samg55_xplained_pro_dbg.upload.protocol=sam-ba
atmel_samg55_xplained_pro_dbg.upload.maximum_size=524288
atmel_samg55_xplained_pro_dbg.upload.use_1200bps_touch=true
atmel_samg55_xplained_pro_dbg.upload.wait_for_upload_port=false
atmel_samg55_xplained_pro_dbg.upload.native_usb=false
atmel_samg55_xplained_pro_dbg.build.mcu=cortex-m4
atmel_samg55_xplained_pro_dbg.build.f_cpu=120000000L
atmel_samg55_xplained_pro_dbg.build.usb_product="Atmel SAMG55-Xplained Pro"
atmel_samg55_xplained_pro_dbg.build.board=SAM_SAMG55_XPRO
atmel_samg55_xplained_pro_dbg.build.core=arduino
atmel_samg55_xplained_pro_dbg.build.extra_flags=-D__SAMG55J19__ -mthumb {build.usb_flags}
atmel_samg55_xplained_pro_dbg.build.ldscript=linker_scripts/gcc/variant_without_bootloader.ld
atmel_samg55_xplained_pro_dbg.build.openocdscript=openocd_scripts/variant.cfg
atmel_samg55_xplained_pro_dbg.build.variant=atmel_samg55_xplained_pro
atmel_samg55_xplained_pro_dbg.build.vid=0x2341
atmel_samg55_xplained_pro_dbg.build.pid=0x003e
atmel_samg55_xplained_pro_dbg.build.usb_flags.off=-DUSB_VID={build.vid} -DUSB_PID={build.pid} -DUSBCON '-DUSB_MANUFACTURER={build.usb_manufacturer}' '-DUSB_PRODUCT={build.usb_product}'
atmel_samg55_xplained_pro_dbg.bootloader.tool=openocd
atmel_samg55_xplained_pro_dbg.bootloader.file=openblt/atmel_samg55_xplained_pro.bin

atmel_samg55_xplained_pro_edbg.name=Atmel SAMG55-Xplained Pro (Programming Port - EDBG)
atmel_samg55_xplained_pro_edbg.vid.0=0x03eb
atmel_samg55_xplained_pro_edbg.pid.0=0x2111
atmel_samg55_xplained_pro_edbg.upload.tool=edbg
atmel_samg55_xplained_pro_edbg.upload.protocol=CMSIS-DAP
atmel_samg55_xplained_pro_edbg.upload.maximum_size=524288
atmel_samg55_xplained_pro_edbg.upload.use_1200bps_touch=false
atmel_samg55_xplained_pro_edbg.upload.wait_for_upload_port=false
atmel_samg55_xplained_pro_edbg.upload.native_usb=false
atmel_samg55_xplained_pro_edbg.build.mcu=cortex-m4
atmel_samg55_xplained_pro_edbg.build.f_cpu=120000000L
atmel_samg55_xplained_pro_edbg.build.usb_product="Atmel SAMG55-Xplained Pro"
atmel_samg55_xplained_pro_edbg.build.board=SAM_SAMG55_XPRO
atmel_samg55_xplained_pro_edbg.build.core=arduino
atmel_samg55_xplained_pro_edbg.build.extra_flags=-D__SAMG55J19__ -mthumb {build.usb_flags}
atmel_samg55_xplained_pro_edbg.build.ldscript=linker_scripts/gcc/variant_without_bootloader.ld
atmel_samg55_xplained_pro_edbg.build.openocdscript=openocd_scripts/variant.cfg
atmel_samg55_xplained_pro_edbg.build.variant=atmel_samg55_xplained_pro
atmel_samg55_xplained_pro_edbg.build.vid=0x2341
atmel_samg55_xplained_pro_edbg.build.pid=0x003e
atmel_samg55_xplained_pro_edbg.build.usb_flags.off=-DUSB_VID={build.vid} -DUSB_PID={build.pid} -DUSBCON '-DUSB_MANUFACTURER={build.usb_manufacturer}' '-DUSB_PRODUCT={build.usb_product}'
atmel_samg55_xplained_pro_edbg.bootloader.tool=openocd
atmel_samg55_xplained_pro_edbg.bootloader.file=openblt/atmel_samg55_xplained_pro.bin
